{"id":"121c1556-7267-48e9-a8d5-4b54a416cef8","url":"scrum-why-we-do-what-we-do-part-1","author":"Mark Taylor","published":"2014-08-17T21:33:00+01:00","modified":"2014-08-18T14:48:18.095+01:00","title":"Scrum - Why we do what we do - part 1, General Development","image":null,"description":"In this series of articles I am looking to outline why Scrum works for us.  During the series I’ll be looking at the challenges in software development today, firstly in general and then specifically with two “traditional” approaches – waterfall and solo working.  In the final part of the series I demonstrate how Scrum works for us to address those challenges.\r\n\r\nI was motivated to produce these articles to educate our wider business.  While we have been operating in a Scrum manner for over two years, acquisition has brought many new faces to the table – many of whom are confused by the way we are working.  It’s also a great opportunity to refresh those that have been working with it for a while.### \r\n### A note on objectivity\r\nI would stress that these articles are not intended as an academic study of the differences between development methodologies.  These articles have been written to highlight the weaknesses that Scrum addresses – thus will likely come across as one-sided when exploring the “traditional” approaches.\r\nFor the same reason, I don’t explore other alternatives for solving any deficiencies within those approaches.### \r\n### Introduction\r\nThis article addresses development in general and raises a number of challenges to be overcome.  The subsequent two articles will add to that list of challenges by looking at two “traditional” development methodologies – [waterfall](http://red-folder.blogspot.co.uk/2014/08/scrum-why-we-do-what-we-do-part-2.html) and [solo working](http://red-folder.blogspot.co.uk/2014/08/scrum-why-we-do-what-we-do-part-3-solo.html).  In the [final part](http://red-folder.blogspot.co.uk/2014/08/scrum-why-we-do-what-we-do-part-4.html) of the series I demonstrate how Scrum works for us to resolve those challenges.","enabled":true,"keyWords":["IT Management","Scrum"],"redirects":[{"redirectType":301,"url":"http://blog.red-folder.com/2014/08/scrum-why-we-do-what-we-do-part-1.html","redirectByRoute":false,"redirectByParameter":true}]}